[Killed] Block removal mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:9:9
     {
         IList<Item> Items;
         public GildedRose(IList<Item> Items)
-        {
-            this.Items = Items;
-        }
+        {}
 
         public void UpdateQuality()
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotChangeSellInOfSulfuras_GivenWeRunUpdateQuality; GildedRoseTests.UpdateQualityTest.Should_NotChangeSellInOfSulfuras_GivenWeRunUpdateQuality; GildedRoseTests.UpdateQualityTest.Should_NotDecreaseQualityBelowZero_GivenQualityIsZero

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:15:29
 
         public void UpdateQuality()
         {
-            for (var i = 0; i < Items.Count; i++)
+            for (var i = 0; i <= Items.Count; i++)
             {
                 if (Items[i].Name != "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotChangeSellInOfSulfuras_GivenWeRunUpdateQuality; GildedRoseTests.UpdateQualityTest.Should_NotChangeSellInOfSulfuras_GivenWeRunUpdateQuality; GildedRoseTests.UpdateQualityTest.Should_NotDecreaseQualityBelowZero_GivenQualityIsZero

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:15:29
 
         public void UpdateQuality()
         {
-            for (var i = 0; i < Items.Count; i++)
+            for (var i = 0; i > Items.Count; i++)
             {
                 if (Items[i].Name != "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_DecreaseSellInValue_GivenAnySellInValue

[Killed] Negate expression
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:17:21
         {
             for (var i = 0; i < Items.Count; i++)
             {
-                if (Items[i].Name != "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
+                if (!(Items[i].Name != "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert"))
                 {
                     if (Items[i].Quality > 0)
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotDecreaseQualityBelowZero_GivenQualityIsZero; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:17:21
         {
             for (var i = 0; i < Items.Count; i++)
             {
-                if (Items[i].Name != "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
+                if (Items[i].Name == "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
                 {
                     if (Items[i].Quality > 0)
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotDecreaseQualityBelowZero_GivenQualityIsZero; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases

[Killed] Negate expression
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:19:25
             {
                 if (Items[i].Name != "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
                 {
-                    if (Items[i].Quality > 0)
+                    if (!(Items[i].Quality > 0))
                     {
                         if (Items[i].Name != "Sulfuras, Hand of Ragnaros")
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotDecreaseQualityBelowZero_GivenQualityIsZero; GildedRoseTests.UpdateQualityTest.Should_DecreaseQuality_GivenWeRunOpdateQuality

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:19:25
             {
                 if (Items[i].Name != "Aged Brie" && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
                 {
-                    if (Items[i].Quality > 0)
+                    if (Items[i].Quality < 0)
                     {
                         if (Items[i].Name != "Sulfuras, Hand of Ragnaros")
killedBy: GildedRoseTests.UpdateQualityTest.Should_DecreaseQuality_GivenWeRunOpdateQuality

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:21:29
                 {
                     if (Items[i].Quality > 0)
                     {
-                        if (Items[i].Name != "Sulfuras, Hand of Ragnaros")
+                        if (Items[i].Name == "Sulfuras, Hand of Ragnaros")
                         {
                             Items[i].Quality = Items[i].Quality - 1;
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotChangeQualityOfSulfuras_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_NotChangeQualityOfSulfuras_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_DecreaseQuality_GivenWeRunOpdateQuality

[Killed] Arithmetic mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:23:48
                     {
                         if (Items[i].Name != "Sulfuras, Hand of Ragnaros")
                         {
-                            Items[i].Quality = Items[i].Quality - 1;
+                            Items[i].Quality = Items[i].Quality + 1;
                         }
                     }
killedBy: GildedRoseTests.UpdateQualityTest.Should_DecreaseQuality_GivenWeRunOpdateQuality

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:29:25
                 }
                 else
                 {
-                    if (Items[i].Quality < 50)
+                    if (Items[i].Quality > 50)
                     {
                         Items[i].Quality = Items[i].Quality + 1;
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess

[Killed] Negate expression
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:29:25
                 }
                 else
                 {
-                    if (Items[i].Quality < 50)
+                    if (!(Items[i].Quality < 50))
                     {
                         Items[i].Quality = Items[i].Quality + 1;
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess

[Killed] Arithmetic mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:31:44
                 {
                     if (Items[i].Quality < 50)
                     {
-                        Items[i].Quality = Items[i].Quality + 1;
+                        Items[i].Quality = Items[i].Quality - 1;
 
                         if (Items[i].Name == "Backstage passes to a TAFKAL80ETC concert")
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:33:29
                     {
                         Items[i].Quality = Items[i].Quality + 1;
 
-                        if (Items[i].Name == "Backstage passes to a TAFKAL80ETC concert")
+                        if (Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
                         {
                             if (Items[i].SellIn < 11)
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:35:33
 
                         if (Items[i].Name == "Backstage passes to a TAFKAL80ETC concert")
                         {
-                            if (Items[i].SellIn < 11)
+                            if (Items[i].SellIn <= 11)
                             {
                                 if (Items[i].Quality < 50)
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy1_GivenSellInAbove10

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:35:33
 
                         if (Items[i].Name == "Backstage passes to a TAFKAL80ETC concert")
                         {
-                            if (Items[i].SellIn < 11)
+                            if (Items[i].SellIn > 11)
                             {
                                 if (Items[i].Quality < 50)
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy2_GivenSellInIs10DaysOrLess

[Killed] Negate expression
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:43:33
                                 }
                             }
 
-                            if (Items[i].SellIn < 6)
+                            if (!(Items[i].SellIn < 6))
                             {
                                 if (Items[i].Quality < 50)
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy3_GivenSellInIs5DaysOrLess; GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy1_GivenSellInAbove10

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:43:33
                                 }
                             }
 
-                            if (Items[i].SellIn < 6)
+                            if (Items[i].SellIn <= 6)
                             {
                                 if (Items[i].Quality < 50)
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseBackStageQualityBy2_GivenSellInIs10DaysOrLess

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:54:21
                     }
                 }
 
-                if (Items[i].Name != "Sulfuras, Hand of Ragnaros")
+                if (Items[i].Name == "Sulfuras, Hand of Ragnaros")
                 {
                     Items[i].SellIn = Items[i].SellIn - 1;
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotChangeSellInOfSulfuras_GivenWeRunUpdateQuality; GildedRoseTests.UpdateQualityTest.Should_NotChangeSellInOfSulfuras_GivenWeRunUpdateQuality; GildedRoseTests.UpdateQualityTest.Should_DecreaseSellInValue_GivenAnySellInValue

[Killed] Arithmetic mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:56:39
 
                 if (Items[i].Name != "Sulfuras, Hand of Ragnaros")
                 {
-                    Items[i].SellIn = Items[i].SellIn - 1;
+                    Items[i].SellIn = Items[i].SellIn + 1;
                 }
 
killedBy: GildedRoseTests.UpdateQualityTest.Should_DecreaseSellInValue_GivenAnySellInValue; GildedRoseTests.UpdateQualityTest.Should_DecreaseSellInValue_GivenAnySellInValue; GildedRoseTests.UpdateQualityTest.Should_SetBackStageQualityToZero_GivenSellInIsBelow0

[Killed] Negate expression
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:59:21
                     Items[i].SellIn = Items[i].SellIn - 1;
                 }
 
-                if (Items[i].SellIn < 0)
+                if (!(Items[i].SellIn < 0))
                 {
                     if (Items[i].Name != "Aged Brie")
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_DecreaseQuality_GivenWeRunOpdateQuality

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:59:21
                     Items[i].SellIn = Items[i].SellIn - 1;
                 }
 
-                if (Items[i].SellIn < 0)
+                if (Items[i].SellIn > 0)
                 {
                     if (Items[i].Name != "Aged Brie")
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_SetBackStageQualityToZero_GivenSellInIsBelow0

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:61:25
 
                 if (Items[i].SellIn < 0)
                 {
-                    if (Items[i].Name != "Aged Brie")
+                    if (Items[i].Name == "Aged Brie")
                     {
                         if (Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_SetBackStageQualityToZero_GivenSellInIsBelow0; GildedRoseTests.UpdateQualityTest.Should_NotIncreaseAgedBrieQualityOver50_GivenSellInIncreases

[Killed] String mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:61:42
 
                 if (Items[i].SellIn < 0)
                 {
-                    if (Items[i].Name != "Aged Brie")
+                    if (Items[i].Name != "")
                     {
                         if (Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
killedBy: GildedRoseTests.UpdateQualityTest.Should_IncreaseAgedBrieQuality_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_NotIncreaseAgedBrieQualityOver50_GivenSellInIncreases

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:63:29
                 {
                     if (Items[i].Name != "Aged Brie")
                     {
-                        if (Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
+                        if (Items[i].Name == "Backstage passes to a TAFKAL80ETC concert")
                         {
                             if (Items[i].Quality > 0)
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotChangeQualityOfSulfuras_GivenSellInIncreases; GildedRoseTests.UpdateQualityTest.Should_SetBackStageQualityToZero_GivenSellInIsBelow0

[Survived] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:65:33
                     {
                         if (Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
                         {
-                            if (Items[i].Quality > 0)
+                            if (Items[i].Quality >= 0)
                             {
                                 if (Items[i].Name != "Sulfuras, Hand of Ragnaros")

[Killed] Arithmetic mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:75:48
                         }
                         else
                         {
-                            Items[i].Quality = Items[i].Quality - Items[i].Quality;
+                            Items[i].Quality = Items[i].Quality + Items[i].Quality;
                         }
                     }
killedBy: GildedRoseTests.UpdateQualityTest.Should_SetBackStageQualityToZero_GivenSellInIsBelow0

[Killed] Equality mutation
Knovember/GildedRoseKata/GildedRose/GildedRose.cs:80:29
                     }
                     else
                     {
-                        if (Items[i].Quality < 50)
+                        if (Items[i].Quality <= 50)
                         {
                             Items[i].Quality = Items[i].Quality + 1;
killedBy: GildedRoseTests.UpdateQualityTest.Should_NotIncreaseAgedBrieQualityOver50_GivenSellInIncreases
